In [4]:
import pandas as pd

dictionary = {"Name" : ["ali", "veli", "ayse", "recep", "ayca", "serdar"], 
              "Age" : ["15", "22", "25", "22", "23", "22"]}

df = pd.DataFrame(dictionary)
df

     Name Age
0     ali  15
1    veli  22
2    ayse  25
3   recep  22
4    ayca  23
5  serdar  22

In [14]:
arr = [1.4,3.7,4.8,6.3,99.9] 
arr

[1.4, 3.7, 4.8, 6.3, 99.9]

In [15]:
arr.pop(2)

4.8

In [16]:
import pandas as pd

dictionary = {"Name" : ["recep", "ayca", "serdar"],
              "Age" : [19,20,21],
              "Salery" : [4000,4200,4300]}

dataFrame1 = pd.DataFrame(dictionary)

dataFrame1

     Name  Age  Salery
0   recep   19    4000
1    ayca   20    4200
2  serdar   21    4300

In [18]:
df1 = dataFrame1.Salery > 4200
df2 = dataFrame1.Age > 20

df_filtrelenmis = dataFrame1[df1 & df2] #filtreleme

df_filtrelenmis

     Name  Age  Salery
2  serdar   21    4300

In [19]:
df1

0    False
1    False
2     True
Name: Salery, dtype: bool

In [20]:
df2

0    False
1    False
2     True
Name: Age, dtype: bool